'''*****************************************************************************************
   ** FileName:        Galois.py
   ** Author:          Jiawei Hawkins
   ** Date:            2019-03-11 星期一 21:42:27
   ** Description:     实现有限域上的四则运算
   ************************************************************************************'''


#以0 - 2 ^ n - 1 作为运算的数字



'''*****************************************************************************************
   ** Date:            2019-03-11 星期一 22:02:27
   ** Description:     实现有限域GF(2^4)上的四则运算
   ************************************************************************************'''

def add_4(a, b):                                          #加法
    return a ^ b

def sub_4(a, b):                                         #减法
    return a ^ b

def div_4(a, b):                                          #除法
    return a ^ b

def mul_4(a, b):                                          #乘法
    index = 0
    sum = 0
    while( b != 0):
        if( b % 2 == 1):
            sum = sum ^ (a << index)
        b = int(b / 2)
        index = index + 1
    return sum

def euc_4(a):                                               #求乘法的逆

print( mul_4(5, 3))

'''*****************************************************************************************
   ** Date:            2019-03-11 星期一 22:02:27
   ** Description:     实现有限域GF(2^8)上的四则运算
   ************************************************************************************'''

def add_8(a, b):  # 加法
    return a ^ b

def sub_8(a, b):  # 减法
    return a ^ b

def div_8(a, b):  # 除法
    return a ^ b

def mul_8(a, b):  # 乘法
    index = 0
    sum = 0
    while (b != 0):
        if (b % 2 == 1):
            sum = sum ^ (a << index)
        b = int(b / 2)
        index = index + 1
    return sum

def euc_8(a):                                               #求乘法的逆